---
kind: method
id: M:Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions.Dispose
source: html/fd89c4f1-89f9-dadc-2d63-b14235a997c6.htm
---
# Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions.Dispose Method

Releases all resources used by the BuildingEnvelopeAnalyzerOptions

## Syntax (C#)
```csharp
public void Dispose()
```